<!DOCTYPE html>
<html>

<head>
    <title>RunTogether!</title>
    <meta name="content-type" ; charset="UTF-8">
</head>

<body>
    <div class="content" align="center">
        <div class="header">
            <h1><a style="font-size: 50px">RunTogether!</a></h1>
            <h4></h4>
            <h4></h4>
        </div>
        <div class="middle" style="font-size: 30px;">
            <?php
            $dis = array(
                array(0, 90, 420, 295, 355, 568, 632, 768, 501, 714, 670, 930, 996, 1029, 1199),
                array(90, 0, 330, 319, 379, 592, 656, 792, 525, 738, 694, 954, 1020, 1053, 1223),
                array(420, 330, 0, 282, 520, 343, 783, 543, 178, 391, 438, 686, 771, 848, 1018),
                array(295, 319, 282, 0, 238, 273, 515, 473, 206, 419, 375, 635, 701, 734, 904),
                array(355, 379, 520, 238, 0, 341, 277, 363, 444, 657, 473, 733, 591, 789, 959),
                array(568, 592, 343, 273, 341, 0, 440, 200, 267, 480, 296, 556, 428, 558, 728),
                array(632, 656, 783, 515, 277, 440, 0, 240, 707, 920, 573, 833, 468, 666, 836),
                array(768, 792, 543, 473, 363, 200, 240, 0, 467, 680, 496, 756, 228, 426, 596),
                array(501, 525, 178, 206, 444, 267, 707, 467, 0, 213, 260, 520, 695, 670, 840),
                array(714, 738, 391, 419, 657, 480, 920, 680, 213, 0, 473, 295, 778, 580, 750),
                array(670, 694, 438, 375, 473, 296, 573, 496, 160, 473, 0, 260, 498, 410, 580),
                array(930, 954, 686, 635, 733, 556, 833, 756, 520, 295, 260, 0, 483, 285, 455),
                array(996, 1020, 771, 701, 591, 428, 468, 228, 695, 778, 498, 483, 0, 198, 368),
                array(1029, 1053, 848, 734, 789, 558, 666, 426, 670, 580, 410, 285, 198, 0, 170),
                array(1199, 1223, 1018, 904, 959, 728, 836, 596, 840, 750, 580, 455, 368, 170, 0)
            );

            $sit = array(
                array(0, 0, 0, 0, 0, 5), array(0, 0, 0, 0, 1, 4), array(0, 0, 0, 0, 2, 3), array(0, 0, 0, 0, 3, 2), array(0, 0, 0, 0, 4, 1),
                array(0, 0, 0, 0, 5, 0), array(0, 0, 0, 1, 0, 4), array(0, 0, 0, 1, 1, 3), array(0, 0, 0, 1, 2, 2), array(0, 0, 0, 1, 3, 1),
                array(0, 0, 0, 1, 4, 0), array(0, 0, 0, 2, 0, 3), array(0, 0, 0, 2, 1, 2), array(0, 0, 0, 2, 2, 1), array(0, 0, 0, 2, 3, 0),
                array(0, 0, 0, 3, 0, 2), array(0, 0, 0, 3, 1, 1), array(0, 0, 0, 3, 2, 0), array(0, 0, 0, 4, 0, 1), array(0, 0, 0, 4, 1, 0),
                array(0, 0, 0, 5, 0, 0), array(0, 0, 1, 0, 0, 4), array(0, 0, 1, 0, 1, 3), array(0, 0, 1, 0, 2, 2), array(0, 0, 1, 0, 3, 1),
                array(0, 0, 1, 0, 4, 0), array(0, 0, 1, 1, 0, 3), array(0, 0, 1, 1, 1, 2), array(0, 0, 1, 1, 2, 1), array(0, 0, 1, 1, 3, 0),
                array(0, 0, 1, 2, 0, 2), array(0, 0, 1, 2, 1, 1), array(0, 0, 1, 2, 2, 0), array(0, 0, 1, 3, 0, 1), array(0, 0, 1, 3, 1, 0),
                array(0, 0, 1, 4, 0, 0), array(0, 0, 2, 0, 0, 3), array(0, 0, 2, 0, 1, 2), array(0, 0, 2, 0, 2, 1), array(0, 0, 2, 0, 3, 0),
                array(0, 0, 2, 1, 0, 2), array(0, 0, 2, 1, 1, 1), array(0, 0, 2, 1, 2, 0), array(0, 0, 2, 2, 0, 1), array(0, 0, 2, 2, 1, 0),
                array(0, 0, 2, 3, 0, 0), array(0, 0, 3, 0, 0, 2), array(0, 0, 3, 0, 1, 1), array(0, 0, 3, 0, 2, 0), array(0, 0, 3, 1, 0, 1),
                array(0, 0, 3, 1, 1, 0), array(0, 0, 3, 2, 0, 0), array(0, 0, 4, 0, 0, 1), array(0, 0, 4, 0, 1, 0), array(0, 0, 4, 1, 0, 0),
                array(0, 0, 5, 0, 0, 0), array(0, 1, 0, 0, 0, 4), array(0, 1, 0, 0, 1, 3), array(0, 1, 0, 0, 2, 2), array(0, 1, 0, 0, 3, 1),
                array(0, 1, 0, 0, 4, 0), array(0, 1, 0, 1, 0, 3), array(0, 1, 0, 1, 1, 2), array(0, 1, 0, 1, 2, 1), array(0, 1, 0, 1, 3, 0),
                array(0, 1, 0, 2, 0, 2), array(0, 1, 0, 2, 1, 1), array(0, 1, 0, 2, 2, 0), array(0, 1, 0, 3, 0, 1), array(0, 1, 0, 3, 1, 0),
                array(0, 1, 0, 4, 0, 0), array(0, 1, 1, 0, 0, 3), array(0, 1, 1, 0, 1, 2), array(0, 1, 1, 0, 2, 1), array(0, 1, 1, 0, 3, 0),
                array(0, 1, 1, 1, 0, 2), array(0, 1, 1, 1, 1, 1), array(0, 1, 1, 1, 2, 0), array(0, 1, 1, 2, 0, 1), array(0, 1, 1, 2, 1, 0),
                array(0, 1, 1, 3, 0, 0), array(0, 1, 2, 0, 0, 2), array(0, 1, 2, 0, 1, 1), array(0, 1, 2, 0, 2, 0), array(0, 1, 2, 1, 0, 1),
                array(0, 1, 2, 1, 1, 0), array(0, 1, 2, 2, 0, 0), array(0, 1, 3, 0, 0, 1), array(0, 1, 3, 0, 1, 0), array(0, 1, 3, 1, 0, 0),
                array(0, 1, 4, 0, 0, 0), array(0, 2, 0, 0, 0, 3), array(0, 2, 0, 0, 1, 2), array(0, 2, 0, 0, 2, 1), array(0, 2, 0, 0, 3, 0),
                array(0, 2, 0, 1, 0, 2), array(0, 2, 0, 1, 1, 1), array(0, 2, 0, 1, 2, 0), array(0, 2, 0, 2, 0, 1), array(0, 2, 0, 2, 1, 0),
                array(0, 2, 0, 3, 0, 0), array(0, 2, 1, 0, 0, 2), array(0, 2, 1, 0, 1, 1), array(0, 2, 1, 0, 2, 0), array(0, 2, 1, 1, 0, 1),
                array(0, 2, 1, 1, 1, 0), array(0, 2, 1, 2, 0, 0), array(0, 2, 2, 0, 0, 1), array(0, 2, 2, 0, 1, 0), array(0, 2, 2, 1, 0, 0),
                array(0, 2, 3, 0, 0, 0), array(0, 3, 0, 0, 0, 2), array(0, 3, 0, 0, 1, 1), array(0, 3, 0, 0, 2, 0), array(0, 3, 0, 1, 0, 1),
                array(0, 3, 0, 1, 1, 0), array(0, 3, 0, 2, 0, 0), array(0, 3, 1, 0, 0, 1), array(0, 3, 1, 0, 1, 0), array(0, 3, 1, 1, 0, 0),
                array(0, 3, 2, 0, 0, 0), array(0, 4, 0, 0, 0, 1), array(0, 4, 0, 0, 1, 0), array(0, 4, 0, 1, 0, 0), array(0, 4, 1, 0, 0, 0),
                array(0, 5, 0, 0, 0, 0), array(1, 0, 0, 0, 0, 4), array(1, 0, 0, 0, 1, 3), array(1, 0, 0, 0, 2, 2), array(1, 0, 0, 0, 3, 1),
                array(1, 0, 0, 0, 4, 0), array(1, 0, 0, 1, 0, 3), array(1, 0, 0, 1, 1, 2), array(1, 0, 0, 1, 2, 1), array(1, 0, 0, 1, 3, 0),
                array(1, 0, 0, 2, 0, 2), array(1, 0, 0, 2, 1, 1), array(1, 0, 0, 2, 2, 0), array(1, 0, 0, 3, 0, 1), array(1, 0, 0, 3, 1, 0),
                array(1, 0, 0, 4, 0, 0), array(1, 0, 1, 0, 0, 3), array(1, 0, 1, 0, 1, 2), array(1, 0, 1, 0, 2, 1), array(1, 0, 1, 0, 3, 0),
                array(1, 0, 1, 1, 0, 2), array(1, 0, 1, 1, 1, 1), array(1, 0, 1, 1, 2, 0), array(1, 0, 1, 2, 0, 1), array(1, 0, 1, 2, 1, 0),
                array(1, 0, 1, 3, 0, 0), array(1, 0, 2, 0, 0, 2), array(1, 0, 2, 0, 1, 1), array(1, 0, 2, 0, 2, 0), array(1, 0, 2, 1, 0, 1),
                array(1, 0, 2, 1, 1, 0), array(1, 0, 2, 2, 0, 0), array(1, 0, 3, 0, 0, 1), array(1, 0, 3, 0, 1, 0), array(1, 0, 3, 1, 0, 0),
                array(1, 0, 4, 0, 0, 0), array(1, 1, 0, 0, 0, 3), array(1, 1, 0, 0, 1, 2), array(1, 1, 0, 0, 2, 1), array(1, 1, 0, 0, 3, 0),
                array(1, 1, 0, 1, 0, 2), array(1, 1, 0, 1, 1, 1), array(1, 1, 0, 1, 2, 0), array(1, 1, 0, 2, 0, 1), array(1, 1, 0, 2, 1, 0),
                array(1, 1, 0, 3, 0, 0), array(1, 1, 1, 0, 0, 2), array(1, 1, 1, 0, 1, 1), array(1, 1, 1, 0, 2, 0), array(1, 1, 1, 1, 0, 1),
                array(1, 1, 1, 1, 1, 0), array(1, 1, 1, 2, 0, 0), array(1, 1, 2, 0, 0, 1), array(1, 1, 2, 0, 1, 0), array(1, 1, 2, 1, 0, 0),
                array(1, 1, 3, 0, 0, 0), array(1, 2, 0, 0, 0, 2), array(1, 2, 0, 0, 1, 1), array(1, 2, 0, 0, 2, 0), array(1, 2, 0, 1, 0, 1),
                array(1, 2, 0, 1, 1, 0), array(1, 2, 0, 2, 0, 0), array(1, 2, 1, 0, 0, 1), array(1, 2, 1, 0, 1, 0), array(1, 2, 1, 1, 0, 0),
                array(1, 2, 2, 0, 0, 0), array(1, 3, 0, 0, 0, 1), array(1, 3, 0, 0, 1, 0), array(1, 3, 0, 1, 0, 0), array(1, 3, 1, 0, 0, 0),
                array(1, 4, 0, 0, 0, 0), array(2, 0, 0, 0, 0, 3), array(2, 0, 0, 0, 1, 2), array(2, 0, 0, 0, 2, 1), array(2, 0, 0, 0, 3, 0),
                array(2, 0, 0, 1, 0, 2), array(2, 0, 0, 1, 1, 1), array(2, 0, 0, 1, 2, 0), array(2, 0, 0, 2, 0, 1), array(2, 0, 0, 2, 1, 0),
                array(2, 0, 0, 3, 0, 0), array(2, 0, 1, 0, 0, 2), array(2, 0, 1, 0, 1, 1), array(2, 0, 1, 0, 2, 0), array(2, 0, 1, 1, 0, 1),
                array(2, 0, 1, 1, 1, 0), array(2, 0, 1, 2, 0, 0), array(2, 0, 2, 0, 0, 1), array(2, 0, 2, 0, 1, 0), array(2, 0, 2, 1, 0, 0),
                array(2, 0, 3, 0, 0, 0), array(2, 1, 0, 0, 0, 2), array(2, 1, 0, 0, 1, 1), array(2, 1, 0, 0, 2, 0), array(2, 1, 0, 1, 0, 1),
                array(2, 1, 0, 1, 1, 0), array(2, 1, 0, 2, 0, 0), array(2, 1, 1, 0, 0, 1), array(2, 1, 1, 0, 1, 0), array(2, 1, 1, 1, 0, 0),
                array(2, 1, 2, 0, 0, 0), array(2, 2, 0, 0, 0, 1), array(2, 2, 0, 0, 1, 0), array(2, 2, 0, 1, 0, 0), array(2, 2, 1, 0, 0, 0),
                array(2, 3, 0, 0, 0, 0), array(3, 0, 0, 0, 0, 2), array(3, 0, 0, 0, 1, 1), array(3, 0, 0, 0, 2, 0), array(3, 0, 0, 1, 0, 1),
                array(3, 0, 0, 1, 1, 0), array(3, 0, 0, 2, 0, 0), array(3, 0, 1, 0, 0, 1), array(3, 0, 1, 0, 1, 0), array(3, 0, 1, 1, 0, 0),
                array(3, 0, 2, 0, 0, 0), array(3, 1, 0, 0, 0, 1), array(3, 1, 0, 0, 1, 0), array(3, 1, 0, 1, 0, 0), array(3, 1, 1, 0, 0, 0),
                array(3, 2, 0, 0, 0, 0), array(4, 0, 0, 0, 0, 1), array(4, 0, 0, 0, 1, 0), array(4, 0, 0, 1, 0, 0), array(4, 0, 1, 0, 0, 0),
                array(4, 1, 0, 0, 0, 0), array(5, 0, 0, 0, 0, 0)
            );

            $a = array();
            $b = array();
            $c = array();
            $a[0] = $_POST['a0'];
            $a[1] = $_POST['a1'];
            $a[2] = $_POST['a2'];
            $a[3] = $_POST['a3'];
            $a[4] = $_POST['a4'];
            $b[0] = $_POST['b0'];
            $b[1] = $_POST['b1'];
            $b[2] = $_POST['b2'];
            $b[3] = $_POST['b3'];
            $b[4] = $_POST['b4'];


            for ($i = 0; $i < 5; $i++) {
                $a[$i] -= 1;
                $b[$i] -= 1;
            }
            for ($i = 0; $i < 252; $i++) {
                $t = 0;
                $tc = 0;
                for ($k = 0; $k < 5; $k++) {
                    for ($j = 0; $j < $sit[$i][$k]; $j++) {
                        $c[$i][$tc++] = $b[$t++];
                    }
                    $c[$i][$tc++] = $a[$k];
                }
                for ($j = 0; $j < $sit[$i][5]; $j++) {
                    $c[$i][$tc++] = $b[$t++];
                }
            }
            $min = 100000;
            for ($i = 0; $i < 252; $i++) {
                $total = 0;
                for ($j = 0; $j < 9; $j++) {
                    $total += $dis[$c[$i][$j]][$c[$i][$j + 1]];
                }
                if ($total < $min) {
                    $min = $total;
                    $plan = $i;
                }
            }

            //    A自己跑
            $singleA = 0;
            $singleB = 0;
            for ($i = 0; $i < 4; $i++) {
                $singleA += $dis[$a[$i]][$a[$i + 1]];
            }

            //    B自己跑
            for ($i = 0; $i < 4; $i++) {
                $singleB += $dis[$b[$i]][$b[$i + 1]];
            }

            printf("经计算，您的最优方案为：</br><a style=\"color: red;\">开始->");
            $number = 1;
            $number2 = 1;
            for ($k = 0; $k < 5; $k++) {
                for ($j = 0; $j < $sit[$plan][$k]; $j++) {
                    printf("B%d->", $number++);
                }
                printf("A%d->", $number2++);
            }
            for ($j = 0; $j < $sit[$plan][5]; $j++) {
                printf("B%d->", $number++);
            }
            printf("结束</br></a>");
            printf("该方案的总里程为<a style=\"color: red;font-size: 50px\">%d</a>米</br>", $min);
            printf("相较之下</br></br>A单独跑里程为<a style=\"color: red;font-size: 50px\">%d</a>米</br>B单独跑里程为<a style=\"color: red;font-size: 50px\">%d</a>米</br>", $singleA, $singleB);
            $maxAB = $singleA > $singleB ? $singleA : $singleB;
            printf("同步系数为：<a style=\"color: purple;font-size: 70px\">%.2f%%</a><a style=\"color: red;font-size: 50px\">", 100 * $maxAB / $min);
            if ($maxAB / $min > 0.9) printf("</br>恭喜你，天选之子！</br>");
            else if ($singleA > $singleB && $singleB < 2000) printf("</br>建议刷新A设备的点位</br>");
            else if ($singleA <= $singleB && $singleA < 2000) printf("</br>建议刷新B设备的点位</br>");
            else printf("</br>建议同时刷新两台设备的点位！");
            ?>
            </a>
        </div>
        <!--脚部-->
        </br></br>
        <div class="footer"> <small>Copyright &copy; Bultrail 版权所有 </div>
    </div>
</body>

</html>